{"source_file": "0000928785-26-000001.txt", "accession_number": "0000928785-26-000001", "conformed_submission_type": "SCHEDULE 13D", "filed_as_of_date": "20260128", "acceptance_datetime": "20260128093127", "subject_company_name": "Nedbank Group LTD", "subject_company_cik": "0001331863", "filed_by_name": "STANDARD BANK OF SOUTH AFRICA LTD", "filed_by_cik": "0000928785", "xml_namespace": "http://www.sec.gov/edgar/schedule13D", "submission_type": "SCHEDULE 13D", "date_of_event": "01/26/2026", "issuer_cik": "0001331863", "issuer_cusip": "ZAE000004875", "issuer_name": "Nedbank Group LTD", "item3_source_of_funds": "Standard Bank is a licensed bank and Financial Service provider in South Africa. SBG Securities Pty Ltd is a subsidiary of the Standard Bank Group and is the equity broker for the group and has a membership with the Johannesburg Stock Exchange and A2X exchange in South Africa.  As part of the Groups trading, investment and hedging strategies, it may hold equity positions from time to time.", "item4_purpose_of_transaction": "Standard Bank is a licensed bank and Financial Service provider in South Africa. SBG Securities Pty Ltd is a subsidiary of the Standard Bank Group and is the equity broker for the group and has a membership with the Johannesburg Stock Exchange and A2X exchange in South Africa.  As part of the Groups trading, investment and hedging strategies, it may hold equity positions from time to time.", "item6_contracts_arrangements": "Standard Bank is a licensed bank and Financial Service provider in South Africa. SBG Securities Pty Ltd is a subsidiary of the Standard Bank Group and is the equity broker for the group and has a membership with the Johannesburg Stock Exchange and A2X exchange in South Africa. As part of the Groups trading, investment and hedging strategies, it may hold equity positions from time to time."}
{"source_file": "0001062993-26-000295.txt", "accession_number": "0001062993-26-000295", "conformed_submission_type": "SCHEDULE 13D/A", "filed_as_of_date": "20260115", "acceptance_datetime": "20260115165635", "subject_company_name": "BlackRock Science & Technology Term Trust", "subject_company_cik": "0001768666", "filed_by_name": "Saba Capital Management, L.P.", "filed_by_cik": "0001510281", "xml_namespace": "http://www.sec.gov/edgar/schedule13D", "submission_type": "SCHEDULE 13D/A", "date_of_event": "01/14/2026", "issuer_cik": "0001768666", "issuer_cusip": "09260K101", "issuer_name": "BlackRock Science & Technology Term Trust", "item3_source_of_funds": "Funds for the purchase of the Common Shares were derived from the subscription proceeds from investors and the capital appreciation thereon and margin account borrowings made in the ordinary course of business.  In such instances, the positions held in the margin accounts are pledged as collateral security for the repayment of debit balances in the account, which may exist from time to time.  Since other securities are held in the margin accounts, it is not possible to determine the amounts, if any, of margin used to purchase the Common Shares reported herein. A total of approximately $80,499,717 was paid to acquire the Common Shares reported herein.", "item4_purpose_of_transaction": null, "item6_contracts_arrangements": null}
{"source_file": "0001104659-26-004599.txt", "accession_number": "0001104659-26-004599", "conformed_submission_type": "SCHEDULE 13D/A", "filed_as_of_date": "20260116", "acceptance_datetime": "20260116170030", "subject_company_name": "Redwire Corp", "subject_company_cik": "0001819810", "filed_by_name": "AE RED HOLDINGS, LLC", "filed_by_cik": "0001880796", "xml_namespace": "http://www.sec.gov/edgar/schedule13D", "submission_type": "SCHEDULE 13D/A", "date_of_event": "01/14/2026", "issuer_cik": "0001819810", "issuer_cusip": "75776W103", "issuer_name": "Redwire Corp", "item3_source_of_funds": null, "item4_purpose_of_transaction": null, "item6_contracts_arrangements": null}
{"source_file": "0001193125-26-013469.txt", "accession_number": "0001193125-26-013469", "conformed_submission_type": "SCHEDULE 13D", "filed_as_of_date": "20260115", "acceptance_datetime": "20260115060212", "subject_company_name": "Aktis Oncology, Inc.", "subject_company_cik": "0002035832", "filed_by_name": "ELI LILLY & Co", "filed_by_cik": "0000059478", "xml_namespace": "http://www.sec.gov/edgar/schedule13D", "submission_type": "SCHEDULE 13D", "date_of_event": "01/12/2026", "issuer_cik": "0002035832", "issuer_cusip": "00973N102", "issuer_name": "Aktis Oncology, Inc.", "item3_source_of_funds": "The Reporting Person beneficially owns an aggregate of 6,344,114 shares of Common Stock of the Issuer, consisting of (a) 788,559 shares of Common Stock that were issued to the Reporting Person at the closing of the Issuer's initial public offering (the \"IPO\") on January 12, 2026 upon the automatic conversion of (i) 2,500,000 shares of Series A-1 Redeemable Convertible Preferred Stock (\"Series A Preferred\") acquired prior to the IPO for an aggregate purchase price of $10.0 million and (ii) 500,000 shares of Series B Redeemable Convertible Preferred Stock (\"Series B Preferred\") acquired prior to the IPO for an aggregate purchase price of $2.0 million; and (b) 5,555,555 shares of Common Stock purchased by the Reporting Person in the IPO at the public offering price of $18.00 per share, for an aggregate purchase price of approximately $100.0 million. The funds used by the Reporting Person to acquire the Series A Preferred, the Series B Preferred and the Common Stock purchased in the IPO consisted of cash on hand.", "item4_purpose_of_transaction": "The Reporting Person acquired the securities reported herein for investment purposes and intends to continue to review its investments in the Issuer on an ongoing basis. Except as set forth herein, the Reporting Person does not currently have any specific plan or proposal to acquire or dispose of Common Stock of the Issuer or any securities exercisable for or convertible into Common Stock of the Issuer, but the Reporting Person, consistent with its investment purpose, may at any time and from time to time directly or indirectly acquire additional or all shares of Common Stock, securities exercisable for or convertible into Common Stock of the Issuer, or other securities of the Issuer, or dispose of any or all of its shares of Common Stock, securities exercisable for or convertible into Common Stock of the Issuer, or other securities of the Issuer. The Reporting Person's determination to make any such acquisitions or dispositions, in each such case, will depend upon a variety of factors, including, but not limited to, an ongoing evaluation of its investment in such securities, applicable legal and/or contractual restrictions, prevailing market conditions, other investment opportunities, liquidity requirements of the Reporting Person and/or other investment considerations. In addition, in connection with the foregoing, the Reporting Person may engage in hedging or other transactions with respect to securities of the Issuer, including but not limited to, swaps and other derivative instruments.\n\nAs part of its ongoing evaluation of its investment in the Issuer, the Reporting Person expects to engage in discussions with directors, officers, members of management and representatives of the Issuer, and may engage in discussions with stockholders, security holders or other interested parties, from time to time covering a range of topics concerning its investment and the Issuer, including operational, financial and strategic initiatives. Furthermore, without limitation, the Reporting Person may also evaluate and discuss other ideas, that if effected, may relate to, or result in, any other matter listed in Items 4(a)-(j) of Schedule 13D. To facilitate its consideration of such matters, the Reporting Person may retain consultants and advisors and may enter into discussions with potential sources of capital and other third parties. The Reporting Person may exchange information with any such persons pursuant to appropriate confidentiality or similar agreements. The Reporting Person will likely take some or all of the foregoing steps at preliminary stages in its consideration of various possible courses of action before forming any intention to pursue any specific plan or proposal.\n\nOther than as described above, the Reporting Person reports that neither it nor, to its knowledge, any of the other persons listed on Schedule A attached to this Schedule 13D, currently has any specific plan or proposal which relates to, or may result in, any of the matters listed in Items 4(a)-(j) of Schedule 13D, although the Reporting Person may, at any time and from time to time, review or reconsider its position and/or change its purpose and/or formulate plans or proposals with respect thereto.", "item6_contracts_arrangements": "Investors' Rights Agreement\n\nThe Reporting Person and certain other stockholders of the Issuer have entered into a Third Amended and Restated Investors' Rights Agreement with the Issuer (the \"Investors' Rights Agreement\"), which provides such stockholders with customary registration rights under the Securities Act of 1933, including demand registration rights, piggyback registration rights and shelf registration rights. The Issuer is required to pay all expenses, subject to certain conditions and exceptions, relating to the exercise of such registration rights. The Investors' Rights Agreement also contains customary cross-indemnification provisions. The Reporting Person's registration rights will terminate upon the earlier of (i) the closing of certain deemed liquidation events, as defined in the Issuer's certificate of incorporation, (ii) when the Reporting Person beneficially owns (together with its \"affiliates,\" as defined in Rule 144 under the Securities Act of 1933, as amended) less than 1% of the Issuer's outstanding capital stock and is able to sell all of its shares pursuant to Rule 144 or another similar exemption during a three-month period without registration and (iii) the third anniversary of the IPO.\n\nLock-Up Agreement\n\nThe Reporting Person has entered into a lock-up agreement pursuant to which the Reporting Person has agreed not to, among other things and subject to various exceptions, sell or transfer Common Stock or securities convertible into or exercisable or exchangeable for Common Stock for 180 days after January 8, 2026 without first obtaining the prior written consent of J.P. Morgan Securities LLC, BofA Securities, Inc., Leerink Partners LLC and TD Securities (USA) LLC on behalf of the underwriters.\n\nThe foregoing descriptions of the Investors' Rights Agreement and the lock-up agreement do not purport to be complete and are qualified in their entirety by reference to the Investors' Rights Agreement and the form of lock-up agreement, listed as Exhibit 2.1 and Exhibit 2.2 hereto, respectively, and incorporated by reference herein."}
{"source_file": "0002103921-26-000001.txt", "accession_number": "0002103921-26-000001", "conformed_submission_type": "SCHEDULE 13G", "filed_as_of_date": "20260115", "acceptance_datetime": "20260115131111", "subject_company_name": "1stdibs.com, Inc.", "subject_company_cik": "0001600641", "filed_by_name": "Sofina Capital S.A.", "filed_by_cik": "0002103921", "xml_namespace": "http://www.sec.gov/edgar/schedule13g", "submission_type": "SCHEDULE 13G", "date_of_event": null, "issuer_cik": null, "issuer_cusip": null, "issuer_name": "1stdibs.com, Inc.", "item3_source_of_funds": null, "item4_purpose_of_transaction": null, "item6_contracts_arrangements": null}
{"source_file": "0002104900-26-000001.txt", "accession_number": "0002104900-26-000001", "conformed_submission_type": "SCHEDULE 13D", "filed_as_of_date": "20260116", "acceptance_datetime": "20260116135617", "subject_company_name": "Syra Health Corp", "subject_company_cik": "0001922335", "filed_by_name": "Johnson Neil Lawrence", "filed_by_cik": "0002104900", "xml_namespace": "http://www.sec.gov/edgar/schedule13D", "submission_type": "SCHEDULE 13D", "date_of_event": "01/13/2026", "issuer_cik": "0001922335", "issuer_cusip": "0001922335", "issuer_name": "Syra Health Corp", "item3_source_of_funds": "Personal Funds", "item4_purpose_of_transaction": "Influence", "item6_contracts_arrangements": "None"}
